# -*- coding:utf-8 -*-
# 파이썬2 사용하는 경우 : 기본 인코딩이 asciif 라서 한글을 인코딩 할 수가 없었음
# 파이썬3 사용하는 경우 : 기본 인코딩이 utf-8, 굳이 안써줘도 됨
#                    다른 개발환경에 연결하거나, 다른 툴 사용할때 명시 O
# 파이썬 주석 표시 '#'
# ';'는 써도되고 안써도되고

print("asdf");

# Python...
#    [Big Data, AI]
        # 분석용 데이터 구축
            # - 직접 : 출 / 퇴근 시간에 노약자석 체크
            # - 누군가가 모아놓은 데이터를 구매
            # - (위의 두 방법을 못하는 경우)
            #    웹 데이터(XML, JSON, HTML) 가져오기
        # 분석 -(사람)-> BigData 분석 프로젝트
        # 분석 -(AI)-> AI 프로젝트
        # 결과를 한눈에 알아보기 쉽게... => 시각화 (표, 그래프)
        
    # => Python은 빅데이터 분석용 도구? 툴? => X => 프로그래밍 언어임(web만들기도 가능!)
    
#################################################################################
#                                 Java vs Python
#################################################################################
# Java : 규칙의 언어
    # 필수)
    #    JDK 설치 
    # 옵션)
    #    eclipse 설치
    #    Project 중요한 개념!
    #    컴파일러 방식
    #    OOP의 코드를 재사용하기 위해서 : 1 file = 1 class 
    #        (하나의 클래스에 객체를 만들어서 사용/ 다른 객체를 만들고 싶을 땐 또다른 클래스를 만들어서 작성했었음)
    
    
# Python : 자유의 언어
    # 필수)
    #    python 설치 (ver 3.8.10) - 개발툴 IDLE이 딸려옴
    #    Add Python 3.8 Path 체크 - 환경 변수 설정
    # 옵션)
    #    eclipse에서 pydev 추가
    #    Project는 그저 단순한 폴더일 뿐...
    #    인터프리터 방식
    #    OOP의 코드 재사용 > 관심 X : 1 file != 1 class
#################################################################################

# BigData : 
#    1) python : 분석용 데이터 구축
#    2) Hadoop : 분석 (리눅스 환경에서 해볼거야)
#    3) python, R : 시각화

#    데이터 구축
#    1) python으로 xml/json 파싱 => DB에 넣을거야
#    2) DB에 있는 데이터를 분석용 파일로 만들거야 (.csv파일, .txt파일, ...)

#################################################################################
    
    

        